In [21]:
open()
file_object = open("month1.csv")

TypeError: open() missing required argument 'file' (pos 1)

In [ ]:
file_object = open("month1.csv")
data = file_object.read()
print(data)

In [ ]:
import pandas as pd
import numpy as np
pd.__version__

In [ ]:
# read data into DF

data_month1 = pd.read_csv("month1.csv")
print(data_month1)

In [ ]:
# Read information data
data_month1.info()

In [ ]:
data_month1

In [ ]:
# lấy data theo 1 or nhiều column
data_month1[['device_id', 'heartrate']]

In [ ]:
# Lấy theo dòng
# Lấy 5 bản ghi đầu
data_month1.head(5)

# Lấy 5 bản ghi cuối
data_month1.tail(5)

# Lấy bản ghi từ x tới y
data_month1[2:5]

# Lấy theo điều kiện, ex: device_id = 2
data_month1[(data_month1['device_id'] == 2) & (data_month1['name'] == 'Sam Knopp')]

In [ ]:
# muốn gắn cái Data frame vừa rồi vào một dataframe khác
data_device2 = data_month1[data_month1['device_id'] == 2]

data_device2

# lưu cái device_id 2 vào một tệp riêng

data_device2.to_csv('device2.csv')

In [25]:
# Thêm một cột id 
# data_month1.insert(0, 'ID', range(0, len(data_month)))
data_month1

        ID        time            name  device_id  heartrate
0        0  1577836800  Deborah Powell          0  52.813907
1        1  1577840400  Deborah Powell          0  53.907890
2        2  1577844000  Deborah Powell          0  52.712959
3        3  1577847600  Deborah Powell          0  52.288042
4        4  1577851200  Deborah Powell          0  52.515610
...    ...         ...             ...        ...        ...
3787  3787  1583002800       James Hou          4  98.650932
3788  3788  1583006400       James Hou          4  98.767708
3789  3789  1583010000       James Hou          4  98.894941
3790  3790  1583013600       James Hou          4  96.512310
3791  3791  1583017200       James Hou          4  57.457069

[3792 rows x 5 columns]

In [ ]:
# Review the data and analyse it. 
# What’s the format of data? 
# List out columns present in data along with their data type

In [31]:
# Sẽ chuyển đối cái time này thành các yếu cầu
# sắp xếp theo heart rate
data_month1.sort_values(by = ['heartrate'])
# xóa hàng, dùng drop(index = [hàng muốn xóa])
# xóa hàng, dùng drop(index = [hàng muốn xóa], ascending=False) => để sắp xếp giảm dần

# describe() => mô tả các chỉ số cơ bản của dataframe
data_month1.describe()

                ID          time    device_id    heartrate
count  3792.000000  3.792000e+03  3792.000000  3792.000000
mean   1895.500000  1.579245e+09     2.037975    80.934083
std    1094.800438  9.186383e+05     1.427260    32.136823
min       0.000000  1.577837e+09     0.000000  -221.991374
25%     947.750000  1.578517e+09     1.000000    58.684736
50%    1895.500000  1.579201e+09     2.000000    86.415107
75%    2843.250000  1.579882e+09     3.000000    97.666333
max    3791.000000  1.583017e+09     4.000000   186.479083